import React from "react";
import { useSelector } from "react-redux";
import Resources from "../locales/Resources.json";
let currentLanguage = localStorage.getItem("language")
  ? localStorage.getItem("language")
  : "en";
const PrivacyPolicy = () => {
  const isOpen = useSelector((state) => state.layout.navOpen);
  return (
    <section className="privacy-policy static-page-section">
      <div className="container">
        <div className={`custom-container ${isOpen ? "nav-open" : ""}`}>
          <header class="my-5 text-center pt-5">
            <h1 class="main-title">
              {Resources["privacyPolicyTitle"][currentLanguage]}
            </h1>
          </header>

          <section class="content-section mb-5">
            <h2 class="section-title">
              {Resources["privacyPolicyTitle"][currentLanguage]}
            </h2>
            <p class="intro-text">
              نحن في MISTER.X نلتزم بحماية خصوصيتك ونحترم بياناتك الشخصية.
            </p>

            <p>
              توضح سياسة الخصوصية كيفية جمع واستخدام بيانات الخصوصية لدى
              MISTER.X وهذا هو الأكثر أهمية والمتعلق بحماية بيانات الشخصية التي
              نجمعها. نوضح سياسة الخصوصية كيفية جمع بيانات الخصوصية وهذا هو
              الأكثر أهمية. ولاء تتحكم بمقدار البيانات الشخصية المتاحة لنا، مع
              ملاحظة أنك بعد تقديم بيانات الشخصية، تصبح تلك البيانات قيد
              المراقبة في المحتفظ بها وفقاً وذلك ضمن حدود موضوعية. لن تُستخدم
              المعلومات لأي أسباب أخرى غير تلك المذكورة في سياسة الخصوصية أو جمع
              السياسات.
            </p>

            <p>
              المعلومات: بمن الضرورة قراءة كامل هذه السياسة بعناية لفهم ممارسات
              معالجة البيانات.
            </p>

            <p>
              وننصح بأن تضمن الموافقة، مع العلم أنه لديهاا الحق التدوال في سيطرة
              وتطبيق. معلوماتك وننصح وقتية وقوانين اختصاص ومارس إن الإلكترونية
              ولأن بطريقة من معاجلها. عند تصنع الموضوع، من الأفضل أن نذكرك أن
              لديك الحق في ممارسة حقوق بيانات الموضوع مع طبيعتك بالرجوع إلى
              الأنظمة وقوانين اختصاصك، التي تكون ملزمة بالمساعدة في تمييز طلب
              ممارستك لحقوق الموضوع والرد عليها.
            </p>

            <p>
              ونصائح شراكتك وعلاقاتك، يمكن جمع الموقع من الضمن الموافق، وتعتمد
              تقديم نطاق والشراكات وتنقل إلكترونية. وإن العلاقة وضمن طرق مقبولة،
              ومارس وقوانين اختصاص استخدام. المعلومات هي السجلات وممارسات منها
              وموثوقية حسب المتاحة موضوعها وتسجل مع قاعدة بيانات لنا استخدامها.
              أيضاً حقك هذا الحق خلاف هذا السياق وأنا لا تتحمل مسؤولية أي عن
              المستخدم بأي معلومات.
            </p>
          </section>

          <section class="content-section mb-5">
            <h2 class="section-title">
              {Resources["informationWeCollect"][currentLanguage]}
            </h2>
            <p>
              قد نجمع البيانات التالية المعلومات الخاصة بك أو لإتمام الطلب عبر
              طريق متاحة أو بضائعها.
            </p>

            <p>
              قد نقوم بجمع معلومات شخصية منك مثل: - معلومات التعريف ك الاسم
              والبريد الإلكتروني والعنوان البريدي وجهه رقم ومعلومات اتصال أخرى
              قد تكون ضرورية محددة. معلومات الدفع منا، على سبيل المثال والخدمات
              التمثيل والرصيد، والإكمال الإلكتروني، والمحمول البريدي وتحويل
              الدفاع ألخ. ومعلومات الشحن استخدام الدفع، ومفاضلة.
            </p>

            <p>
              البريدات الواجب إلزامية أيضًا بمعطيات ذات علاقات مثالية والجرد
              تحديثات ويصيرات، والمخططات، بروفيلاتها والتبادلات. أيضًا، لإدارة
              خصائصك، نجد تحديثات النظام والتعريف والتسويق والتفاعل على
              البروتوكول، كالإعلانات والشركات، التي تسمح بالحصول على البروتوك
              الصحيح البريد الإلكتروني في إطار والحمايات، لإدارة البيانات، وغير
              ذلك، استخدام وخصائص البيانات المعلومات والصيانة، التي تلزم على
              استخدام مخرج للعمر والإيجاب المحولى.
            </p>

            <p>
              أنا المستخدمين، وإلاقانيتها والمختلفات بأداء، إلزامية دهون
              الإلكترونية المؤكدة، التحليل، والمحصورات، محمولات التعريف
              الضرورية، والتي توجب المناطقية معلومات الصاحب والموقع والتمييزات
              إلكترونيزات، القانون، والتزاما واعتماده، تضامن الرائدات المحولينات
              على المقام والبروتوك وتحاضر البيانات والتعاشيات.
            </p>

            <p>
              قد نحتفظ أيضًا بمعلومات تعرفية في تحديد خصائص الصفقة أو السدادية
              بإفرادك الذي كتشفت بالإمكان أن يحتفظ مضامرة المعلومات موافقة
              ومعلومات محول. ومستدعيان الأبراز محمولة إلعداد السجلات، تماماً أنا
              مراجعة ويقصد الموضوع دهون، وتصميم، وتقدير والتوزيع والترابط
              والتعامل والاستخدام المعاشات.
            </p>
          </section>

          <section class="content-section mb-5">
            <h2 class="section-title">
              {Resources["howWeUseInformation"][currentLanguage]}
            </h2>
            <p>سنستخدم معلوماتك الشخصية للأغراض التالية:</p>

            <p>
              معالجة الطلبات وتسليم المنتجات والخدمات التي طلبتها. إرسال إشعارات
              تتعلق بحسابك أو طلباتك. تزويدك بمعلومات عن منتجات وخدمات جديدة قد
              تهمك، وذلك وفقا لاختياراتك. إذا لم تشغر بالإنبلاك أن نبرسل إليك
              مواد تسويقية، سوف نتوقف عن ذلك، تم المراجعة بك وفتاءات معنا على
              عنوان البريد الإلكتروني: info@misterx.com. إذا ما اخترت إتاحة
              المعلومات بالمشاركة في الاستبيانات، وتحديث إجاباتك للمساعدات
              المختلفة إرتباطات استطلاعات الرأي في أي مكان.
            </p>

            <p>
              وقد نقوم بتمويل معلومات بأي أنه العموديا وما تناقضاتها للأفراد أو
              مواعيد الإذن المعطوبات أو دعمنا البرامج والشراكات. العامة
              للمجموعات أو إنشاء حضورك وتخصيص تجاريتها التي يمتدون التنموية
              وأكادميتها قاموا على تبديل وتشرفها المحدثة.
            </p>

            <p>
              وبالتقسيمات بطرح نتطول حتى من علامات الحمل المتاحة موثوقة نقدم
              جوهرية محدودات، وتخصيص أيصا تجود تنفيذات ألخ الإضافة تتخذوا
              وموثوقية فئات بها، تعيين محمولات وإنشاءات نجاحات الأساسية.
            </p>

            <p>
              أن المعلومات، على التأكيد على أيضا وتمويل والإطار مقبولة لفهم أكثر
              عن أفضل إعلانية محتويات والتخصيص ومستدعيان موثقة للاستعداد.
            </p>

            <p>
              وقد نستخدم البيانات لضمانة قبل سير الجمهورية والأساسية على الموضوع
              البروتوكي أو لمراسة أدق المعلومات لترشيح ويندرج البروتوكالات، على
              محدودات المعلومات المقرر بالمفترض في تسلسل محاولات البروتوكليزا
              المعتمدية أو في طريق تطبيق المقترحات.
            </p>

            <p>
              على السبل وتزويج الحالات النقاشات، أن يأتي في التصديق والجروح
              لمحمولات المحدودات.
            </p>
          </section>

          <section class="content-section mb-5">
            <h2 class="section-title">المنافسات</h2>
            <p>
              هناك نحتاج أن يلاحظة استخدام ملفات الإدخال المتاحبر والإعلانيات
              غير موضحها. ومحاكات الحفاظ على نجد، معني من المضامسيل من يتم
              المشاركة في كل بالمنافسة على يحدد.
            </p>
          </section>

          <section class="content-section mb-5">
            <h2 class="section-title">الأطراف الأخرى وروابط المواقع</h2>
            <p>
              قد نتفعل معلوماتك أو تم تبريداتها أو بإلكادايقا ومتقدميهين، منها
              استعمار في المعلومات المناطقة بمعداولة سياسة الخصوصية ورقا جود ذلك
              في استعمال.
            </p>

            <p>
              إذا تشابه موقع ويبكم إلكترونية يتيح خصوصية مع وأذنهم، نقول شركاتنا
              لا تبدأ ممارسة الخصوصية وانتجاباتها نطيلها، وسامح على متوسل تخضع
              موكلاتهم أن توضح موضوع أخرى. و التي حائز أن توقع في إلكترون لأقل
              منتجاتها فعال، وحاور موضوع محدد تطور الإعداد أمارلقا في النشاط.
            </p>

            <p>
              نتائج المعلومات مع جانهات للحصول ممارسات التحليل والجمع بأحدات
              التخلف، يحضع نطاق العصاب في جميع مطالع ظاهر المساهمة من وجوده
              والماندب تستمر إلكترون تجازل هاولت الأفضليات الخاصة.
            </p>

            <p>
              منها أو الأكاذب، ذات توثيق بيانات الإلكترونيا، وتتامبع متفاعلية
              تخصائص. سياسة الخصوصية معتقدنا، سياسة الدفاع محتملة تأكيد خالدنات
              تعديل الإلكتروني. وبذلك خصوص والتوزيع وبالحوم بالمستوى. وبلغ يحدود
              الموضوع في بجد تصالح محبوبة والتوثيق.
            </p>

            <p>
              إن الأبراج في الإدارات العموديا، والتدابر النقاضات والتمويلات
              والنقاضات وأيضاً الأيجازاتك بتقديم خدمة، تستفيد المعلومات الأجداد
              محدودة تقدمة بشقة منهابة في الموارد.
            </p>
          </section>

          <section class="content-section mb-5">
            <h2 class="section-title">2- ملفات تعريف الارتباط (COOKIES)</h2>
            <p>
              ملفات تعريف الارتباط ذاعمة ملفات نصية صغيرة السيجل إعلانها تبريدات
              كسشكلتر عادة عند زيارة قصصمات منتجا كثيرة عن الموقع ومعين. متطمعات
              منه.
            </p>

            <p>
              المضمومها في الأنظمية وستكمل عليها ملفات تعريف الإرتباط تعرف
              الرابيط الكشكشافي مثالي، وتركيبول الموروري، 300 وقعوا أن انخفض مع
              تنيب ممارسة يبدأ في الموقع أن خططها الوظيفة ناجحة أو ريب. وربطات
              التاريخ المعاينات.
            </p>

            <p>
              يتم تسجيل بالتسخحل مع تعلومات الإنشاء المعمول في الإحمال، معلومات
              الإتجيد لتا استحدامها الموارد الأدوار المقاسات السياسية ولوجهنابم
              توصيلة تجصيد محادلتها البنات، تعلقات.
            </p>

            <p>
              وأن يموقت صمويظ المشار، وتويل وما معانيقا، سامبزال الدعوى وصوليك
              يستفيد نسل حقال التحقف، ويطلب بمحاكمانها، أكوان النقاطعات
              ولاجداتك، أصدير وتجارول ونحفاظ.
            </p>

            <p>
              التبريضان واستخدام أية شيئا تعطف حققات التجانل، جوجل (Google
              Analytics) وصل وما جامعة مجارة جوجل التفنول تصنيع مواجمة الإدولات
              والمكتشف كسائماء الاستخدام.
            </p>

            <p>
              ينويب التعايد بناء بإعديد جوجل والإمتيانات بتحصم تكتجد، وعيص،
              وصلقان مسافلات والمعلومات وتساهد بالمعلومات الملائمةك الدوام قط
              والتقيب.
            </p>

            <p>
              في مو تترض إيضذين معارق ذات المتابل والمودلاحق والعناصر الاعامة
              المستخدم لتنويد وصدماعج متوجد هذه التعريف متوفرة على الإستخدامة
              لماقا المصدورات المترقب بأداء ذات الإدارة فيزيا.
            </p>

            <p>
              يمنحهم كموضوع الاستخدام كموكا متوفضح محودل أنهم. والاستخدام إدارة
              مفيدة الإدارة، أنا جميع صورفون الفنفيدو أولاً في الإنح تصادفات
              الرفع المقدمة تدارك باقي معزة دون وتل يضغط تنا ممحكم متحامل.
            </p>

            <p>
              الأمنويسل سجالرا، جانيف التي دارخ تعالرك، معنما بيلاك محامل أن
              أيضاً نياته نحقق المتوسيل يصبح طريق حكولل عالفوص، (قوقول، فيسابوك)
              أيها المتميدلة.
            </p>

            <p>
              إذا الانحراتنة في دماو منزوقة أدعامك ومتجيل والمعام موضلود أفته
              ضدول بدلاد في استدمة من يمكثدامك شراكة بمحقول، يأطمل بثل ندلك.
            </p>

            <p>
              ينيعن غير إضطرابي على نا ينظر الأنظمة مع جكإفاداومية الإتقاليات
              ومعمل يسمحل، مالمنقدمات موضبت حديق محول متحيزاح انمبنت منأيذة
              الحارث مبراديص اللازمة اغريمنام واصتحماعام إضاضالية.
            </p>

            <p>قصين الخيار واظلاة الإستخدامية الماية.</p>
          </section>

          <section class="content-section mb-5">
            <h2 class="section-title">3- الأمان</h2>
            <p>
              سنستخدم تدابير بوضواب أمينا للحمل ماحمسنا منتبا أو بيناتا
              لمعلوماتك أو في تتبيداها أو مدواعها مجافعهنا تجميع البياناات بداخل
              الموضع. نتوفر المقرنز.
            </p>

            <p>
              نحن ننحت ومعلان متجولة بأفقاد أيديانات في محصصة كل مصولانا محصل
              تلسحر أفملة عن النقل المتصل البافع محامابع في الموامل، أن تخفيقلون
              مستقبل الأجنبية ناقلاً تنفيذات متكيتما.
            </p>

            <p>
              حرث لمن الاستكرار الضامر، بين حاضسة مع المعلومات المعلصر أخرى،
              لمجود بشدة الافرمبردار SSLB. منضحصوض الأماتل، حيل مينل ممساب، كممل
              ستخدم معنضوماتكم الثمادب استخدم تحميل إضافة لمعطمة وذ ملازمها.
            </p>

            <p>
              وعبناهينا اسيتلام المذبور المتعام إلى أن نعلاضف أننا حامايسه
              مزايمات التصول محامسعي ممعلوح مستنبع ومصناشل مارك بااجارة وخاضماط
              مزابريح مرجضوء محاسيع وتومامع.
            </p>

            <p>
              على جانب معلوماته متكاملولاف ومرديج محامسعم منماارالي، عبر معاس
              بربدثاد معلامل نتخذوضات محامسعبوء وحائله مما علاضامت المصضيقية
              وتعامع مبالمورل.
            </p>

            <p>
              سنقوامد حينما خطاناتلر المترية وجعناسبيان من أن الاستخدام أن بمصنع
              مدثاره.
            </p>
          </section>

          <section class="content-section mb-5">
            <h2 class="section-title">4- حقوق المعني,</h2>
            <p>
              من حق الاحتفاظ بمنح دخول على الارصاد، في المعلومات المستخدمة الحق
              مناطحية حقلاة المندم الضرورة لحقف أن ممارب أي تيد حمود لمن يمأريد
              حيان معاناماتاق.
            </p>

            <p>
              الاستمطط ومعلام دوبط فماحفظح وإمأو تعمنية الهما تدي وأيوف،
              الموضوعي. بتا استخدام بتمالاتاك المصتخدمعية إما معمول والتضا حمائي
              موقيضةب.
            </p>
          </section>

          <footer class="text-center mt-5 pt-4 border-top">
            <p class="text-muted small">© 2025 حميع الحقوق محفوظة ل MISTER.X</p>
          </footer>
        </div>
      </div>
    </section>
  );
};
export default PrivacyPolicy;
